ololoshka2871/pcm_utils/MaxParcer/stc007binarizer.cpp
#include <chrono>

#include "stc007binarizer.h"

STC007Binarizer::STC007Binarizer()
{
    // Set default preset.
    this->digi_set.digpre_max_black_lvl = 210;
    this->digi_set.digpre_min_white_lvl = 30;
    this->digi_set.digpre_min_contrast = 20;
    this->digi_set.digpre_max_black_dist = 20;
    this->digi_set.digpre_max_white_dist = 32;
    this->digi_set.digpre_min_ref_lvl = 10;
    this->digi_set.digpre_max_ref_lvl = 240;
    this->digi_set.digpre_mark_max_dist = 10;
    this->digi_set.digpre_max_threads = 3;

    this->video_line = NULL;
    this->log_level = 0;
    this->in_def_reference = 0;
    this->in_def_data_start = 0;
    this->in_def_data_stop = 0;
    this->max_threads = 1;
    this->do_pixel_shift = true;
    this->do_ref_level_sweep = true;

    this->proc_state = STG_REF_FIND;
    this->line_length = 0;
    this->br_black = 0;
    this->br_white = 0;
    this->ref_level = this->digi_set.digpre_max_ref_lvl;
    this->mark_start_max = 0;
    this->mark_end_min = 0xFFFF;
    this->ref_sweep_en = false;
    this->black_level_detected = false;
    this->white_level_detected = false;
}

//------------------------ Set debug logging level (LOG_PROCESS, etc...).
void STC007Binarizer::setLogLevel(uint8_t in_level)
{
    this->log_level = in_level;
}

//------------------------ Enable/disable pixel offset shifting and retrying if CRC fails.
void STC007Binarizer::setPixelShiftRetry(bool flag)
{
    this->do_pixel_shift = flag;
#if LB_EN_DBG_OUT
    if((log_level&LOG_SETTINGS)!=0)
    {
        if(flag==true)
        {
            qInfo()<<"[LB] Pixel shifting set to 'enabled'.";
        }
        else
        {
            qInfo()<<"[LB] Pixel shifting set to 'disabled'.";
        }
    }
#endif
}

//------------------------ Enable/disable reference level sweeping (precise, calculation intensive).
void STC007Binarizer::setRefLevelSweep(bool flag)
{
    this->do_ref_level_sweep = flag;
#if LB_EN_DBG_OUT
    if((log_level&LOG_SETTINGS)!=0)
    {
        if(flag==true)
        {
            qInfo()<<"[LB] Reference level sweeping set to 'enabled'.";
        }
        else
        {
            qInfo()<<"[LB] Reference level sweeping set to 'disabled'.";
        }
    }
#endif
}

//------------------------ Set default reference level (0 = disabled).
void STC007Binarizer::setReferenceLevel(uint8_t in_ref)
{
    if(in_ref>0)
    {
        // Set value from the input.
        this->in_def_reference = in_ref;
#if LB_EN_DBG_OUT
        if((log_level&LOG_SETTINGS)!=0)
        {
            qInfo()<<"[LB] Default reference level set to"<<this->in_def_reference;
        }
#endif
    }
    else
    {
        // Reset to default.
        this->in_def_reference = 0;
#if LB_EN_DBG_OUT
        if((log_level&LOG_SETTINGS)!=0)
        {
            qInfo()<<"[LB] Default reference level is disabled.";
        }
#endif
    }
}

//------------------------ Set default pixel coordinates for data (0 = disabled)
void STC007Binarizer::setDataCoordinates(uint16_t in_data_start, uint16_t in_data_stop)
{
    if((in_data_start>0)&&(in_data_stop>0)&&(in_data_start<in_data_stop))
    {
        // Set values from the input.
        this->in_def_data_start = in_data_start;
        this->in_def_data_stop = in_data_stop;
#if LB_EN_DBG_OUT
        if((log_level&LOG_SETTINGS)!=0)
        {
            qInfo()<<"[LB] Default data pixel coordinates set to"<<
                     this->in_def_data_start<<"-"<<this->in_def_data_stop;
        }
#endif
    }
    else
    {
        // Reset to default.
        this->in_def_data_start = 0;
        this->in_def_data_stop = 0;
#if LB_EN_DBG_OUT
        if((log_level&LOG_SETTINGS)!=0)
        {
            qInfo()<<"[LB] Default data pixel coordinates are disabled.";
        }
#endif
    }
}

//------------------------ Set maximum available computing threads.
void STC007Binarizer::setMaxThreads(uint8_t in_threads)
{
    if(in_threads>0)
    {
        // Set value from the input.
        this->max_threads = in_threads;
    }
    else
    {
        // Reset to default.
        this->max_threads = 1;
    }
#if LB_EN_DBG_OUT
    if((log_level&LOG_SETTINGS)!=0)
    {
        qInfo()<<"[LB] Maximum available threads set to"<<this->max_threads;
    }
#endif
}

//------------------------ Take video line, perform AGC, TBC, binarization.
//------------------------ Output PCM data line [STC007line].
uint8_t STC007Binarizer::processLine(VideoLine *in_video_line, STC007Line *out_stc007_line)
{
    uint8_t stage_count, thread_cnt, lvls_per_thread;
    uint8_t min_ref_level, max_ref_level;
    uint32_t tmp_calc;
    bool ref_low_det;

    // Measure processing time for debuging.
    auto start = std::chrono::high_resolution_clock::now();

    ref_low_det = false;

    if(in_video_line==NULL)
    {
#if LB_EN_DBG_OUT
        qWarning()<<"[LB] Null pointer for video line provided, exiting...";
#endif
        return (uint8_t)LB_RET_NULL_VIDEO;
    }
    if(out_stc007_line==NULL)
    {
#if LB_EN_DBG_OUT
        qWarning()<<"[LB] Null pointer for STC-007 line provided, exiting...";
#endif
        return (uint8_t)LB_RET_NULL_STC;
    }
    // Copy VideoLine pointer for internal functions.
    video_line = (VideoLine *)in_video_line;

    // Reset some parameters.
    br_black = 0;
    br_white = 0;

    // Store parameters in new PCM-line object.
    out_stc007_line->frame_number = in_video_line->frame_number;
    out_stc007_line->line_number = in_video_line->line_number;
    if(in_video_line->deint_mode==VideoLine::DEINT_TFF)
    {
        out_stc007_line->deint_mode = STC007Line::DEINT_TFF;
    }
    else if(in_video_line->deint_mode==VideoLine::DEINT_BFF)
    {
        out_stc007_line->deint_mode = STC007Line::DEINT_BFF;
    }
    else
    {
        out_stc007_line->deint_mode = STC007Line::DEINT_OFF;
    }
    out_stc007_line->skip_line = in_video_line->doSkip();

    // Check if line is 100% empty.
    if(in_video_line->isEmpty()==false)
    {
        //----------- STEP 1: Calculate line length, limits for PCM START and PCM STOP markers search,
        //----------- estimate pixels-per-bit value.
        // Get current line length in pixels.
        line_length = in_video_line->pixel_data.size();
        if(line_length<(4+128+5))   // 128 bits of PCM, 4 bits of START marker, 5 bits of STOP marker.
        {
#if LB_EN_DBG_OUT
            qWarning()<<"[LB] Line is too short for PCM data, exiting...";
#endif
            return (uint8_t)LB_RET_SHORT_LINE;
        }

        // Determine limits within the line for marker search.
        mark_start_max = line_length*digi_set.digpre_mark_max_dist/100;
        mark_end_min = line_length-mark_start_max;
        // Estimate minimum ending marker length.
        tmp_calc = line_length*128;
        tmp_calc = tmp_calc/140;
        min_mark_len = (uint16_t)((tmp_calc+64)/128);
#if LB_EN_DBG_OUT
        if((log_level&LOG_PROCESS)!=0)
        {
            QString log_line;
            log_line.sprintf("[LB] -------------------- Line [%03u], size: %03u pixels, estimated PPB: %u, available threads: %u",
                             out_stc007_line->line_number, line_length, min_mark_len, max_threads);
            qInfo()<<log_line;
        }
#endif
        // Pre-calculate minimum PCM STOP marker length (which is 4 bits long).
        min_mark_len = min_mark_len*2;
        //min_mark_len = min_mark_len*5/2;        //  *2.5

        // Set the first stage for state machine.
        proc_state = STG_REF_FIND;
        // Check for provided working reference level.
        if(in_def_reference>digi_set.digpre_min_ref_lvl)
        {
            // Set the state to indicate that at least reference level is provided.
            proc_state = STG_INPUT_LEVEL;
#if LB_EN_DBG_OUT
            if((log_level&LOG_PROCESS)!=0)
            {
                qInfo()<<"[LB] Reference level is provided:"<<in_def_reference;
            }
#endif
        }
        if(in_def_data_stop!=0)
        {
            // Set the state for all possible data inputs.
            proc_state = STG_INPUT_ALL;
#if LB_EN_DBG_OUT
            if((log_level&LOG_PROCESS)!=0)
            {
                qInfo()<<"[LB] Data coordinates are provided:"<<in_def_data_start<<"-"<<in_def_data_stop;
            }
#endif
        }

        // Cycle through stages.
        stage_count = 0;
        do
        {
            // Count loops.
            stage_count++;

            // Select processing mode.
            if(proc_state==STG_DATA_OK)
            {
                // PCM data was decoded successfully.
#if LB_EN_DBG_OUT
                if((log_level&LOG_PROCESS)!=0)
                {
                    qInfo()<<"[LB] -------------------- Valid PCM data was found, work is done.";
                }
#endif
                // Exit stage cycle.
                break;
            }
            else if(proc_state==STG_NO_GOOD)
            {
                // All efforts went to trash - no valid PCM data was found.
#if LB_EN_DBG_OUT
                if((log_level&LOG_PROCESS)!=0)
                {
                    qInfo()<<"[LB] -------------------- No valid PCM data was found in the line.";
                }
#endif
                // Exit stage cycle.
                break;
            }
            else if(proc_state==STG_INPUT_ALL)
            {
                // Preset coordinates from input.
                out_stc007_line->data_start_coord = in_def_data_start;
                out_stc007_line->data_stop_coord = in_def_data_stop;
                // Preset reference level from input.
                out_stc007_line->ref_level = in_def_reference;
                ref_level = in_def_reference;
                // Set parameters to pass checks in the end.
                out_stc007_line->mark_st_stage = STC007Line::MARK_ST_BOT_2;
                out_stc007_line->mark_ed_stage = STC007Line::MARK_ED_LEN_OK;
                // Reference level sweep is disabled for this pass.
                out_stc007_line->ref_level_sweeped = false;
                ref_sweep_en = false;
#if LB_EN_DBG_OUT
                if((log_level&LOG_PROCESS)!=0)
                {
                    qInfo()<<"[LB] ---------- Parameters are set from the input, bypassing coordinates and reference level calculation...";
                }
#endif
                // Try to read PCM data with those parameters.
                if(readPCMdata(out_stc007_line)==REF_CRC_OK)
                {
                    // Set the flag that data was decoded using external parameters.
                    out_stc007_line->data_by_ext_tune = true;
                    // Data is OK, go to exit.
                    proc_state = STG_DATA_OK;
                }
                else
                {
                    // No valid data, let's try to find markers.
                    proc_state = STG_INPUT_LEVEL;
#if LB_EN_DBG_OUT
                    if((log_level&LOG_PROCESS)!=0)
                    {
                        qInfo()<<"[LB] No valid data found with provided data coordinates and reference level.";
                    }
#endif
                }
            }
            else if(proc_state==STG_INPUT_LEVEL)
            {
                // Preset reference level from input.
                out_stc007_line->ref_level = in_def_reference;
                ref_level = in_def_reference;
                // Reset marker coordinates.
                out_stc007_line->data_start_coord = 0;
                out_stc007_line->data_stop_coord = 0;
                // Reset marker detection stages.
                out_stc007_line->mark_st_stage = STC007Line::MARK_ST_START;
                out_stc007_line->mark_ed_stage = STC007Line::MARK_ED_START;
                // Reference level sweep is disabled for this pass.
                out_stc007_line->ref_level_sweeped = false;
                ref_sweep_en = false;
#if LB_EN_DBG_OUT
                if((log_level&LOG_PROCESS)!=0)
                {
                    qInfo()<<"[LB] ---------- Reference level is set from the input, bypassing reference level calculation...";
                }
#endif
                // Find coordinates for PCM START and STOP markers ([findPCMmarkers()] resets all marker coordinates).
                findPCMmarkers(out_stc007_line);

                // Check if markers were found at all.
                if(out_stc007_line->hasMarkers()!=true)
                {
                    // Markers (both or one of those) are not found.
                    // No reason to try decoding anything, go to full processing.
                    proc_state = STG_REF_FIND;
#if LB_EN_DBG_OUT
                    if((log_level&LOG_PROCESS)!=0)
                    {
                        qInfo()<<"[LB] Markers were not found with provided reference level.";
                    }
#endif
                }
                else
                {
                    // Markers were found, try to decode data.
                    if(readPCMdata(out_stc007_line)==REF_CRC_OK)
                    {
                        // Set the flag that data was decoded using external parameters.
                        out_stc007_line->data_by_ext_tune = true;
                        // Data is OK, go to exit.
                        proc_state = STG_DATA_OK;
                    }
                    else
                    {
                        // No valid data, let's try to find reference level.
                        proc_state = STG_REF_FIND;
#if LB_EN_DBG_OUT
                        if((log_level&LOG_PROCESS)!=0)
                        {
                            qInfo()<<"[LB] No valid data found with provided reference level.";
                        }
#endif
                    }
                }
            }
            else if(proc_state==STG_REF_FIND)
            {
                // Nothing is preset, do the whole calculation.
#if LB_EN_DBG_OUT
                if((log_level&LOG_PROCESS)!=0)
                {
                    qInfo()<<"[LB] ---------- Reference level detection starting...";
                }
#endif
                // Find WHITE and BLACK levels, find STOP marker.
                findBlackWhite(out_stc007_line);

                // Check for early PCM detection in the line.
                if((white_level_detected==true)&&(out_stc007_line->hasStopMarker()==true))
                {
                    // If allowed - enable reference level sweep.
                    if(do_ref_level_sweep==true)
                    {
                        ref_sweep_en = true;
                    }
                    if(ref_sweep_en!=true)
                    {
                        // Calculate reference level if sweep is disabled.
                        calcRefLevel();
                        // Store reference level.
                        out_stc007_line->ref_level = ref_level;
                        // Proceed with single data decoding.
                        proc_state = STG_READ_PCM;
                    }
                    else
                    {
                        // Go to full reference level sweep.
                        proc_state = STG_REFSCAN_RUN;

                        // DEBUG
                        //ref_sweep_en = false;

