ololoshka2871/pcm_utils/MaxParcer/stc007binarizer.cpp
                    }
                }
                else
                {
                    // No WHITE level - no PCM.
                    proc_state = STG_NO_GOOD;
                }
            }
            else if(proc_state==STG_REFSCAN_RUN)
            {
                // Do reference level sweep.
#if LB_EN_DBG_OUT
                if((log_level&LOG_PROCESS)!=0)
                {
                    qInfo()<<"[LB] ---------- Full reference level sweep starting...";
                }
#endif
                // Reset spread data for reference level.
                spread_data.fill(0);

    /*#pragma omp parallel
                sweepRefLevel(&spread_data, br_black, br_white, 0);*/

                // Limit number of threads.
                if(max_threads>digi_set.digpre_max_threads)
                {
                    thread_cnt = digi_set.digpre_max_threads;
                }
                else
                {
                    thread_cnt = max_threads;
                }
                // Calculate number of levels to check for each thread.
                lvls_per_thread = br_white-br_black;
                lvls_per_thread = lvls_per_thread/thread_cnt;
                if(lvls_per_thread==0)
                {
                    lvls_per_thread = 1;
                }
#if LB_EN_DBG_OUT
                if((log_level&LOG_SWEEP)!=0)
                {
                    QString log_line;
                    qInfo()<<"[LB] Levels per thread:"<<lvls_per_thread;
                    log_line = "[LB] Thread spans: ";
                    for(uint8_t thrd=0;thrd<thread_cnt;thrd++)
                    {
                        if((thrd==(thread_cnt-1))||((br_black+lvls_per_thread*(thrd+1))>=br_white))
                        {
                            log_line += " ("+QString::number(br_black+lvls_per_thread*thrd)+":"+QString::number(br_white)+"]";
                            break;
                        }
                        else
                        {
                            log_line += " ("+QString::number(br_black+lvls_per_thread*thrd)+":"+QString::number(br_black+lvls_per_thread*(thrd+1))+"]";
                        }
                    }
                    qInfo()<<log_line;
                }
#endif

                // Storage for temporary threads.
                std::vector<std::thread> threads;
                bool last_thread;
                last_thread = false;
                // Launching all sweep threads.
                for(uint8_t thrd=0;thrd<thread_cnt;thrd++)
                {
                    // Determine range of brightnesses.
                    if((thrd==(thread_cnt-1))||((br_black+lvls_per_thread*(thrd+1))>=br_white))
                    {
                        min_ref_level = br_black+lvls_per_thread*thrd;
                        max_ref_level = br_white;
                        last_thread = true;
                    }
                    else
                    {
                        min_ref_level = br_black+lvls_per_thread*thrd;
                        max_ref_level = br_black+lvls_per_thread*(thrd+1);
                    }
                    // Start separate workers in threads.
                    threads.push_back(std::thread(&STC007Binarizer::sweepRefLevel, this, &spread_data, min_ref_level, max_ref_level, thrd));
                    if(last_thread==true) break;
                }
                // Wait until all threads are finished.
                for(uint8_t thrd=0;thrd<threads.size();thrd++)
                {
                    threads[thrd].join();
                }
                // Clear threads storage.
                for(uint8_t thrd=0;thrd<threads.size();thrd++)
                {
                    threads.pop_back();
                }

                // Preset span boundaries to be updated in cycle.
                min_ref_level = digi_set.digpre_max_ref_lvl;
                max_ref_level = digi_set.digpre_min_ref_lvl;
                ref_low_det = false;
                // Cycle through whole range of brightnesses to find "good" reference level span.
                for(ref_level=br_black;ref_level<br_white;ref_level++)
                {
                    if(spread_data[ref_level]==REF_CRC_OK)
                    {
                        if(max_ref_level<ref_level)
                        {
                            // Store highest reference value.
                            max_ref_level = ref_level;
                        }
                        if(min_ref_level>ref_level)
                        {
                            // Store lowest reference value if it is not locked yet.
                            min_ref_level = ref_level;
                            // Set "reference low level detected" flag.
                            ref_low_det = true;
                        }
                    }
                    else
                    {
                        if(ref_low_det==true)
                        {
                            // If good level was detected earlier and now it is not - search is done.
                            break;
                        }
                    }
                }

                // Check if "good reference level" span was found.
                if(ref_low_det==true)
                {
                    // Get center of the "good reference level" span.
                    ref_level = max_ref_level-min_ref_level;
                    ref_level = (ref_level+1)/2;
                    // Set that as final reference level.
                    ref_level += min_ref_level;
                    out_stc007_line->ref_level = ref_level;
                    // Set flag that reference level was sweeped.
                    out_stc007_line->ref_level_sweeped = true;
#if LB_EN_DBG_OUT
                    if((log_level&LOG_PROCESS)!=0)
                    {
                        QString log_line;
                        log_line.sprintf("[LB] Good reference level span [%03u:%03u] detected", min_ref_level, max_ref_level);
                        qInfo()<<log_line;
                    }
                    if((log_level&LOG_SWEEP)!=0)
                    {
                        QString stats;
                        for(uint16_t index=0;index<256;index++)
                        {
                            if(index==ref_level)
                            {
                                stats += "*";
                            }
                            else
                            {
                                stats += QString::number(spread_data[index]);
                            }
                        }
                        qInfo()<<"[LB] Sweep"<<out_stc007_line->line_number<<stats;
                    }
#endif
                }
                else
                {
                    // No good reference level was found.
#if LB_EN_DBG_OUT
                    if((log_level&LOG_PROCESS)!=0)
                    {
                        qInfo()<<"[LB] No good reference value was found during sweep.";
                    }
#endif
                    // Fallback to other value.
                    // Check for provided working reference level.
                    if(in_def_reference>digi_set.digpre_min_ref_lvl)
                    {
                        // Copy provided value from good line.
                        ref_level = in_def_reference;
                    }
                    else
                    {
                        // Set calculated estimate.
                        calcRefLevel();
                    }
                    // Copy calculated value into the line.
                    out_stc007_line->ref_level = ref_level;
                }

                // Disable "do reference level sweep" for final log output.
                ref_sweep_en = false;

