ololoshka2871/pcm_utils/MaxParcer/stc007binarizer.cpp
                // Proceed with final data decoding.
                proc_state = STG_READ_PCM;
            }
            else if(proc_state==STG_READ_PCM)
            {
#if LB_EN_DBG_OUT
                if((log_level&LOG_PROCESS)!=0)
                {
                    qInfo()<<"[LB] ---------- Brighness threshold:"<<out_stc007_line->ref_level;
                    if((log_level&LOG_VIDEO)!=0)
                    {
                        QString log_line;
                        uint8_t pixel_data;
                        for(uint16_t pixel=0;pixel<line_length;pixel++)
                        {
                            pixel_data = getVideoPixel(pixel);
                            if(pixel_data>=out_stc007_line->ref_level)
                            {
                                log_line += "1";
                            }
                            else
                            {
                                log_line += "0";
                            }
                        }
                        qInfo()<<"[LB] Binarized line data:";
                        qInfo()<<log_line;
                    }
                }
#endif
                // Find coordinates for PCM START and STOP markers with set reference level.
                findPCMmarkers(out_stc007_line);
                // Reading PCM data with calculated parameters.
                if(readPCMdata(out_stc007_line)==REF_CRC_OK)
                {
                    // Data read OK, work is done.
                    proc_state = STG_DATA_OK;
                }
                else
                {
                    // No valid PCM data found.
                    proc_state = STG_NO_GOOD;
                }
            }
            else
            {
#if LB_EN_DBG_OUT
                qWarning()<<"[LB] -------------------- Impossible state detected, breaking...";
#endif
                break;
            }

            // Check for looping.
            if(stage_count>STG_MAX)
            {
#if LB_EN_DBG_OUT
                qWarning()<<"[LB] -------------------- Inf. loop detected, breaking...";
#endif
                break;
            }
        }
        while(1);   // Stages cycle.
    }
#if LB_EN_DBG_OUT
    else
    {
        if((log_level&LOG_PROCESS)!=0)
        {
            qInfo()<<"[LB] Line marked as 'empty', skipping all processing...";
        }
    }
#endif

    // Store time that processing took.
    uint64_t line_time;
    auto end = std::chrono::high_resolution_clock::now();
    out_stc007_line->process_time = (uint32_t)(std::chrono::duration_cast<std::chrono::microseconds>(end - start).count());

    return (uint8_t)LB_RET_OK;
}


//------------------------ Debug wrapper for getting value from pixel vector.
uint8_t STC007Binarizer::getVideoPixel(uint16_t x_coord)
{
#ifdef LB_EN_PIXEL_DBG
    if(video_line==NULL)
    {
        qWarning()<<"[LB] Video line has NULL pointer!";
        return (line_length-1);
    }
    else
    {
        if(x_coord<=(line_length-1))
        {
            // Normal result.
            return video_line->pixel_data.at(x_coord);
        }
        else
        {
            // Pixel coordinate out of bounds.
            qWarning()<<"[LB] Incorrect pixel coordinate! ("<<x_coord<<") while processing frame"
                      <<frame_number<<"line"<<line_number;
            return (line_length-1);
        }
    }
#else
    return video_line->pixel_data.at(x_coord);
#endif
}

//------------------------ Find coordinates of START and STOP markers.
void STC007Binarizer::findPCMmarkers(STC007Line *pcm_line, uint8_t thread_id, bool no_log)
{
    uint8_t marker_detect_stage, pixel_data;
    uint16_t pixel;
    uint16_t mark_st_1bit_start,    // Pixel coordinate of the start of the 1st "1" START bits.
             mark_st_1bit_end,      // Pixel coordinate of the end of the 1st "1" START bits and of the start of the 1st "0" START bits.
             mark_st_3bit_start,    // Pixel coordinate of the start of the 2nd "1" START bits and of the end of the 1st "0" START bits.
             mark_st_3bit_end,      // Pixel coordinate of the end of the 2nd "1" START bits and of the start of the 2nd "0" START bits.
             mark_ed_bit_start,     // Pixel coordinate of the start of the "1111" STOP bits and of the end of the "0" STOP bit.
             mark_ed_bit_end;       // Pixel coordinate of the end of the "1111" STOP bits.
    //----------- STEP 6: perform binarization and
    //----------- find coordinates of PCM START marker.
    marker_detect_stage = STC007Line::MARK_ST_START;
    mark_st_1bit_start = 0;
    mark_st_1bit_end = 0;
    mark_st_3bit_start = 0;
    mark_st_3bit_end = 0;
    for(pixel=0;pixel<=mark_start_max;pixel++)
    {
        pixel_data = getVideoPixel(pixel);
        if(marker_detect_stage==STC007Line::MARK_ST_START)
        {
            // Detect /\ transition to first "1" marker bit.
            if(pixel_data>=(pcm_line->ref_level))
            {
                mark_st_1bit_start = pixel;
                marker_detect_stage = STC007Line::MARK_ST_TOP_1;
            }
        }
        else if(marker_detect_stage==STC007Line::MARK_ST_TOP_1)
        {
            // Detect \/ transition to first "0" marker bit.
            if(pixel_data<(pcm_line->ref_level))
            {
                mark_st_1bit_end = pixel;
                // Check if detected "bit" complies with required length (min_mark_len = pixel_per_bit x 4).
                if((mark_st_1bit_end-mark_st_1bit_start)>min_mark_len)
                {
                    // Reset search if length is inadequate.
                    marker_detect_stage = STC007Line::MARK_ST_START;
#if LB_EN_DBG_OUT
                    if(((log_level&LOG_PROCESS)!=0)&&(no_log!=true))
                    {
                        QString log_line;
                        log_line.sprintf("[LB-%02u] Erroneous START-bit[1] at [%03u:%03u], restarting...", thread_id, mark_st_1bit_start, mark_st_1bit_end);
                        qInfo()<<log_line;
                    }
#endif
                }
                else
                {
                    marker_detect_stage = STC007Line::MARK_ST_BOT_1;
#if LB_EN_DBG_OUT
                    if(((log_level&LOG_PROCESS)!=0)&&(no_log!=true))
                    {
                        QString log_line;
                        log_line.sprintf("[LB-%02u] START-bit[1] found at [%03u:%03u]", thread_id, mark_st_1bit_start, mark_st_1bit_end);
                        qInfo()<<log_line;
                    }
#endif
                }
            }
        }
        else if(marker_detect_stage==STC007Line::MARK_ST_BOT_1)
        {
            // Detect /\ transition to second "1" marker bit.
            if(pixel_data>=(pcm_line->ref_level))
            {
                mark_st_3bit_start = pixel;
                // Check if detected "bit" complies with required length (min_mark_len = pixel_per_bit x 4).
                if((mark_st_3bit_start-mark_st_1bit_end)>min_mark_len)
                {
                    // Reset search if length is inadequate.
                    marker_detect_stage = STC007Line::MARK_ST_START;
#if LB_EN_DBG_OUT
                    if(((log_level&LOG_PROCESS)!=0)&&(no_log!=true))
                    {
                        QString log_line;
                        log_line.sprintf("[LB-%02u] Erroneous START-bit[2] at [%03u:%03u], restarting...", thread_id, mark_st_1bit_end, mark_st_3bit_start);
                        qInfo()<<log_line;
                    }
#endif
                }
                else
                {
                    marker_detect_stage = STC007Line::MARK_ST_TOP_2;
#if LB_EN_DBG_OUT
                    if(((log_level&LOG_PROCESS)!=0)&&(no_log!=true))
                    {
                        QString log_line;
                        log_line.sprintf("[LB-%02u] START-bit[2] found at [%03u:%03u]", thread_id, mark_st_1bit_end, mark_st_3bit_start);
                        qInfo()<<log_line;
                    }
#endif
                }
            }
        }
        else if(marker_detect_stage==STC007Line::MARK_ST_TOP_2)
        {
            // Detect \/ transition to second "0" marker bit.
            if(pixel_data<(pcm_line->ref_level))
            {
                mark_st_3bit_end = pixel;
                // Check if detected "bit" complies with required length (min_mark_len = pixel_per_bit x 4).
                if((mark_st_3bit_end-mark_st_3bit_start)>min_mark_len)
                {
                    // Reset search if length is inadequate.
                    marker_detect_stage = STC007Line::MARK_ST_START;
#if LB_EN_DBG_OUT
                    if(((log_level&LOG_PROCESS)!=0)&&(no_log!=true))
                    {
                        QString log_line;
                        log_line.sprintf("[LB-%02u] Erroneous START-bit[3] at [%03u:%03u], restarting...", thread_id, mark_st_3bit_start, mark_st_3bit_end);
                        qInfo()<<log_line;
                    }
#endif
                }
                else
                {
                    marker_detect_stage = STC007Line::MARK_ST_BOT_2;
#if LB_EN_DBG_OUT
                    if(((log_level&LOG_PROCESS)!=0)&&(no_log!=true))
                    {
                        QString log_line;
                        log_line.sprintf("[LB-%02u] START-bit[3] found at [%03u:%03u]", thread_id, mark_st_3bit_start, mark_st_3bit_end);
                        qInfo()<<log_line;
                    }
#endif
                    // Stop marker search.
                    break;
                }
            }
        }
    }
    //findPCMmarkers_out_start_find:
#if LB_EN_DBG_OUT
    if(((log_level&LOG_PROCESS)!=0)&&(no_log!=true))
    {
        if(marker_detect_stage!=STC007Line::MARK_ST_BOT_2)
        {
            QString log_line;
            log_line.sprintf("[LB-%02u] START marker was NOT found!", thread_id);
            qInfo()<<log_line;
        }
    }
#endif
    // Store final state.
    pcm_line->mark_st_stage = marker_detect_stage;
    // Save marker start coordinate.
    pcm_line->marker_start_coord = mark_st_1bit_start;
    // Save data start coordinate.
    pcm_line->data_start_coord = mark_st_1bit_end;

    //----------- STEP 7: Refine coordinates of PCM STOP marker with new reference level.
    // Re-find PCM ending marker (after reference adjustment).
    marker_detect_stage = STC007Line::MARK_ED_START;
    mark_ed_bit_start = 0;
    mark_ed_bit_end = 0;
    // Perform PCM STOP-marker refinement only if PCM START-marker was detected.
    if(pcm_line->hasStartMarker())
    {
        for(pixel=(line_length-1);pixel>=mark_end_min;pixel--)
        {
            pixel_data = getVideoPixel(pixel);
            if(marker_detect_stage==STC007Line::MARK_ED_START)
            {
                // Detect /\ transition to "1" marker bit.
                if(pixel_data>=(pcm_line->ref_level))
                {
                    mark_ed_bit_end = pixel+1;
                    marker_detect_stage=STC007Line::MARK_ED_TOP;
                }
            }
            else if(marker_detect_stage==STC007Line::MARK_ED_TOP)
            {
                // Detect \/ transition to "0" marker bit.
                if(pixel_data<(pcm_line->ref_level))
                {
                    mark_ed_bit_start = (pixel+1);
                    marker_detect_stage = STC007Line::MARK_ED_BOT;
                    // Check if "1" bit length is of correct length.
                    if((mark_ed_bit_end-mark_ed_bit_start)>=(min_mark_len/2))
                    {
                        marker_detect_stage = STC007Line::MARK_ED_LEN_OK;
#if LB_EN_DBG_OUT
                        if(((log_level&LOG_PROCESS)!=0)&&(no_log!=true))
                        {
                            QString log_line;
                            log_line.sprintf("[LB-%02u] STOP-marker updated to be at [%03u:%03u]", thread_id, mark_ed_bit_start, mark_ed_bit_end);
                            qInfo()<<log_line;
                        }
#endif
                        // Stop marker search.
                        break;
                    }
                    else
                    {
                        // Wrong "1" bit length, probably noise - reset state machine.
                        marker_detect_stage = STC007Line::MARK_ED_START;
#if LB_EN_DBG_OUT
                        if(((log_level&LOG_PROCESS)!=0)&&(no_log!=true))
                        {
                            QString log_line;
                            log_line.sprintf("[LB-%02u] Erroneous STOP-marker at [%03u:%03u], restarting...", thread_id, mark_ed_bit_start, mark_ed_bit_end);
                            qInfo()<<log_line;
                        }
#endif
                    }
                }
            }
        }
    }
    //findPCMmarkers_out_stop_find:
    // Store final state.
    pcm_line->mark_ed_stage = marker_detect_stage;
    // Save data stop coordinate.
    pcm_line->data_stop_coord = mark_ed_bit_start;
    // Save marker stop coordinate.
    pcm_line->marker_stop_coord = mark_ed_bit_end;
}

//------------------------ Find WHITE and BLACK levels, calculate reference level.
void STC007Binarizer::findBlackWhite(STC007Line *pcm_line)
{
    uint8_t pixel_data, brt_lev, marker_detect_stage;
    uint16_t black_lvl_count, white_lvl_count, search_lim;
    uint16_t mark_ed_bit_start,     // Pixel coordinate of the start of the "1111" STOP bits and of the end of the "0" STOP bit.
            mark_ed_bit_end;        // Pixel coordinate of the end of the "1111" STOP bits.
    //----------- STEP 2: Calculate brightness spread for the line
    //----------- and find WHITE level.
    // Reset brightness spread data.
    spread_data.fill(0);
    // Pre-calculate rough brighness spread (can contain black borders and other garbade).
    // Calculate spread of brighness for the left side of the line (containing PCM START marker).
    for(uint16_t pixel=0;pixel<mark_start_max;pixel++)
    {
        spread_data[getVideoPixel(pixel)]++;
    }
    // Calculate spread of brighness for the right side of the line (containing PCM STOP marker).
    for(uint16_t pixel=mark_end_min;pixel<line_length;pixel++)
    {
        spread_data[getVideoPixel(pixel)]++;
    }
#if LB_EN_DBG_OUT
    if(((log_level&LOG_BRIGHT)!=0)&&((log_level&LOG_PROCESS)!=0))
    {
        QString stats;
        for(uint16_t index=0;index<256;index++)
        {
            stats += QString::number(spread_data[index])+",";
        }
        qInfo()<<"[LB] Full line brighness spread:"<<stats;
    }
#endif
    // Find "white" level (via most frequent high-value).
    brt_lev = 255;
    white_lvl_count = 0;
    white_level_detected = false;
    while(brt_lev>=digi_set.digpre_min_white_lvl)
    {
        // Search for maximum encounters in high brightness.
        if(spread_data[brt_lev]>white_lvl_count)
        {
            // Store current encounters of "white" level.
            white_lvl_count = spread_data[brt_lev];
            // Store new WHITE level (as coordinate of peak encounters).
            br_white = brt_lev;
            // Store "WHITE level found" flag.
            white_level_detected = true;
        }
        if(white_level_detected==true)
        {
            // If white level was found in process, check for current distance from that peak.
            if((br_white-brt_lev)>digi_set.digpre_max_white_dist)
            {
                // No need to search so far from found peak.
                break;
            }
        }
        brt_lev--;
    }
#if LB_EN_DBG_OUT
    if((log_level&LOG_PROCESS)!=0)
    {
        if(white_level_detected==true)
        {
            QString log_line;
            log_line.sprintf("[LB] WHITE level detected as [%03u] with [%03u] encounters", br_white, white_lvl_count);
            qInfo()<<log_line;
        }
        else
        {
            QString log_line;
            log_line.sprintf("[LB] WHITE level was NOT detected!");
            qInfo()<<log_line;
        }
    }
#endif

