ololoshka2871/pcm_utils/MaxParcer/stc007binarizer.cpp
    //----------- STEP 3: Find presence and coordinates of PCM STOP marker,
    //----------- if found, recalculate brightness spread for CRC part of the line.
    marker_detect_stage = STC007Line::MARK_ED_START;
    mark_ed_bit_start = 0;
    mark_ed_bit_end = 0;
    // Check if white level was detected (if not - markers can not be found).
    if(white_level_detected==true)
    {
        // Define reference level for white detection.
        //ref_level = br_white-(br_white/5);
        ref_level = br_white/2;
        // Find position of PCM ending marker.
        for(uint16_t pixel=(line_length-1);pixel>=mark_end_min;pixel--)
        {
            pixel_data = getVideoPixel(pixel);
            if(marker_detect_stage==STC007Line::MARK_ED_START)
            {
                // Detect /\ transition to "1" marker bit.
                if(pixel_data>=ref_level)
                {
                    mark_ed_bit_end = pixel+1;
                    marker_detect_stage=STC007Line::MARK_ED_TOP;
                }
            }
            else if(marker_detect_stage==STC007Line::MARK_ED_TOP)
            {
                // Detect \/ transition to "0" marker bit.
                if(pixel_data<ref_level)
                {
                    mark_ed_bit_start = pixel+1;
                    marker_detect_stage = STC007Line::MARK_ED_BOT;
                    // Check if "1" bit length is more than pre-calculated at start.
                    if((mark_ed_bit_end-mark_ed_bit_start)>=min_mark_len)
                    {
                        marker_detect_stage = STC007Line::MARK_ED_LEN_OK;
#if LB_EN_DBG_OUT
                        if((log_level&LOG_PROCESS)!=0)
                        {
                            QString log_line;
                            log_line.sprintf("[LB] STOP-marker found at [%03u:%03u]", mark_ed_bit_start, mark_ed_bit_end);
                            qInfo()<<log_line;
                        }
#endif
                        // Store length of the ending marker (4 x PPB).
                        min_mark_len = mark_ed_bit_end-mark_ed_bit_start;
                        // Set the limited distance (covering CRC area) from STOP-marker for short brightness spread re-calc.
                        search_lim = min_mark_len*16;
                        if(search_lim>mark_ed_bit_start)
                        {
                            search_lim = 0;
                        }
                        else
                        {
                            search_lim = mark_ed_bit_start-search_lim;
                        }
                        // Reset brightness spread data.
                        spread_data.fill(0);
                        // Re-calculate spread of brighness for the end of the line.
                        for(uint16_t pixel=(mark_ed_bit_start-1);pixel>search_lim;pixel--)
                        {
                            spread_data[getVideoPixel(pixel)]++;
                        }
#if LB_EN_DBG_OUT
                        if((log_level&LOG_BRIGHT)!=0)
                        {
                            QString stats;
                            for(uint16_t index=0;index<256;index++)
                            {
                                stats += QString::number(spread_data[index])+",";
                            }
                            qInfo()<<"[LB] CRC part ("<<search_lim<<"-"<<(mark_ed_bit_start-1)<<") brighness spread:"<<stats;
                        }
#endif
                        // Stop marker search.
                        break;
                    }
                    else
                    {
                        // Wrong "1" bit length, probably noise - reset state machine.
                        marker_detect_stage = STC007Line::MARK_ED_START;
#if LB_EN_DBG_OUT
                        if((log_level&LOG_PROCESS)!=0)
                        {
                            QString log_line;
                            log_line.sprintf("[LB] Erroneous STOP-marker at [%03u:%03u], restarting...", mark_ed_bit_start, mark_ed_bit_end);
                            qInfo()<<log_line;
                        }
#endif
                    }
                }
            }
        }
        //findBlackWhite_out_stop_find:
#if LB_EN_DBG_OUT
        // Check if PCM ending marker was found.
        if(marker_detect_stage!=STC007Line::MARK_ED_LEN_OK)
        {
            if((log_level&LOG_PROCESS)!=0)
            {
                qInfo()<<"[LB] STOP marker was NOT found!";
            }
        }
#endif
    }
    // Store final state.
    pcm_line->mark_ed_stage = marker_detect_stage;
    // Save coordinates.
    pcm_line->data_stop_coord = mark_ed_bit_start;
    pcm_line->marker_stop_coord = mark_ed_bit_end;

    //----------- STEP 4: Find BLACK level from brighness spread data.
    // Find "black" level (via most frequent low-value).
    brt_lev = 0;
    black_lvl_count = 0;
    black_level_detected = false;
    while(brt_lev<digi_set.digpre_max_black_lvl)
    {
        // Search for maximum encounters in low brightness.
        if(spread_data[brt_lev]>black_lvl_count)
        {
            // Store current encounters of "black" level.
            black_lvl_count = spread_data[brt_lev];
            // Store new "white" level (as coordinate of peak encounters).
            br_black = brt_lev;
            // Store "black level found" flag.
            black_level_detected = true;
        }
        if(black_level_detected==true)
        {
            // If black level was found, check for current distance from that peak.
            if((brt_lev-br_black)>digi_set.digpre_max_black_dist)
            {
                // No need to search so far from found peak.
                break;
            }
        }
        brt_lev++;
    }
    // Reset reference level.
    if(br_white<digi_set.digpre_max_ref_lvl)
    {
        ref_level = digi_set.digpre_max_ref_lvl;
    }
    else
    {
        ref_level = digi_set.digpre_min_ref_lvl;
    }
#if LB_EN_DBG_OUT
    if((log_level&LOG_PROCESS)!=0)
    {
        if(black_level_detected==true)
        {
            QString log_line;
            log_line.sprintf("[LB] BLACK level detected as [%03u] with [%03u] encounters", br_black, black_lvl_count);
            qInfo()<<log_line;
        }
        else
        {
            QString log_line;
            log_line.sprintf("[LB] BLACK level was NOT detected!");
            qInfo()<<log_line;
        }
    }
#endif
}

//------------------------ Calculate reference level from BLACK and WHITE levels.
void STC007Binarizer::calcRefLevel()
{
    uint8_t br_delta;
    //----------- STEP 5: Check contrast and calculate reference brightness level for binarization.
    // Get delta between "white" and "black".
    br_delta = br_white-br_black;
    // Check for contrast.
    if(br_delta>=digi_set.digpre_min_contrast)
    {
        // Contrast is Ok.
        // Calculate PCM reference level.

        //br_delta = br_delta/3;        // br_delta/1.5
        //br_delta = br_delta/3;
        //br_delta = br_delta/2;
        //br_delta = br_delta*10/22;    // br_delta/2.2
        //br_delta = br_delta/3;
        //br_delta = (br_delta*4)/13; // br_delta/3.25
        br_delta = (br_delta*2)/7;  // br_delta/3.5
        //br_delta = (br_delta*25)/91;  // br_delta/3.64
        //br_delta = br_delta/4;

        // Shift reference level by black level.
        ref_level = br_delta+br_black;
        // Limit reference level.
        if(ref_level<digi_set.digpre_min_ref_lvl)
        {
            ref_level = digi_set.digpre_min_ref_lvl;
        }
        else if(ref_level>digi_set.digpre_max_ref_lvl)
        {
            ref_level = digi_set.digpre_max_ref_lvl;
        }
    }
    else
    {
#if LB_EN_DBG_OUT
        if((log_level&LOG_PROCESS)!=0)
        {
            qInfo()<<"[LB] Contrast is too low!";
        }
#endif
        // Contrast is too low, set reference beyond the range of brightnesses.
        if(br_white<digi_set.digpre_max_ref_lvl)
        {
            ref_level = digi_set.digpre_max_ref_lvl;
        }
        else
        {
            ref_level = digi_set.digpre_min_ref_lvl;
        }
    }
#if LB_EN_DBG_OUT
    if((log_level&LOG_PROCESS)!=0)
    {
        qInfo()<<"[LB] Calculated reference level:"<<ref_level;
    }
#endif
}

//------------------------ Perform reference level sweep from one level to another (multithreadable).
void STC007Binarizer::sweepRefLevel(std::array<uint16_t, 256> *result, uint8_t low_lvl, uint8_t high_lvl, uint8_t thread_id)
{
    uint8_t ref_index;
    STC007Line dummy_line;
#if LB_EN_DBG_OUT
    if((log_level&LOG_SWEEP)!=0)
    {
        QString log_line;
        log_line.sprintf("[LB-%02u] Reference level sweep: [%03u...%03u]", thread_id, (low_lvl+1), high_lvl);
        qInfo()<<log_line;
    }
#endif

    // Cycle through provided range of brightnesses to get CRC result stats.
    for(ref_index=high_lvl;ref_index>low_lvl;ref_index--)
    {
        dummy_line.ref_level = ref_index;
        // Find coordinates for PCM START and STOP markers with set reference level.
        if((log_level&LOG_SWEEP)!=0)
        {
            findPCMmarkers(&dummy_line, thread_id, false);
        }
        else
        {
            findPCMmarkers(&dummy_line, thread_id, true);
        }
        // Check if markers were found.
        if(dummy_line.hasMarkers()==true)
        {
            // Binarize and read PCM data, calculate CRC.
            // Store decode result in spread data.
            if((log_level&LOG_SWEEP)!=0)
            {
                result->at(ref_index) = readPCMdata(&dummy_line, thread_id, false);
            }
            else
            {
                result->at(ref_index) = readPCMdata(&dummy_line, thread_id, true);
            }
        }
#if LB_EN_DBG_OUT
        else if((log_level&LOG_SWEEP)!=0)
        {
            QString log_line;
            log_line.sprintf("[LB-%02u] Markers not found", thread_id);
            qInfo()<<log_line;
        }
#endif
    }
}

