ololoshka2871/pcm_utils/MaxParcer/stc007binarizer.cpp
//------------------------ Calculate PPB, fill up data words, recalculate and compare CRC.
void STC007Binarizer::fillDataWords(STC007Line *pcm_line, uint8_t shift_dir, bool no_log)
{
    uint8_t pixel_data, shift_sw, pcm_byte;

    uint8_t word_bit_pos, byte_bit_pos;
    uint8_t word_index, byte_index;
    uint16_t pcm_word;

    // No pixel shift.
    shift_sw = STC007Line::PIX_NO_SHIFT;
    // Perform pixel offset shifting if required.
    if(shift_dir==1)
    {
        // Shift line to the left by 1 pixel.
        shift_sw = STC007Line::PIX_SHIFT_POS;
    }
    else if(shift_dir==2)
    {
        // Shift line to the right by 1 pixel.
        shift_sw = STC007Line::PIX_SHIFT_NEG;
    }

#if LB_EN_DBG_OUT
    if(((log_level&LOG_VIDEO)!=0)&&(no_log!=true))
    {
        QString log_line;
        log_line = "[LB] Pixel coordinates: ";
        pcm_word = 0;
        word_bit_pos = 0;
        for(uint8_t pcm_bit=0;pcm_bit<129;pcm_bit++)
        {
            pcm_word++;
            // Find bit coodinate in video line.
            log_line += QString::number(pcm_line->findVideoPixel(line_length, pcm_bit, shift_sw))+",";
        }
        log_line += " total pixels: "+QString::number(pcm_word);
        qInfo()<<log_line;
    }
#endif

    // Fill up 14 bit words (and 16 bit CRCC).
    pcm_byte = 0;
    pcm_word = 0;
    byte_bit_pos = 7;
    word_bit_pos = 13;
    byte_index = 0;
    word_index = 0;

    for(uint8_t pcm_bit=1;pcm_bit<129;pcm_bit++)
    {
        // Pick the bit.
        pixel_data = getVideoPixel(pcm_line->findVideoPixel(line_length, pcm_bit, shift_sw));
        // Perform binarization.
        if(pixel_data>=(pcm_line->ref_level))
        {
            // Set the bit if presents at current bit position.
            pcm_word |= (1<<word_bit_pos);
            pcm_byte |= (1<<byte_bit_pos);
        }
        // Check if the byte is complete.
        if(byte_bit_pos==0)
        {
            // Save completed byte.
            pcm_line->bytes[byte_index] = pcm_byte;
            // Go to the next byte.
            byte_index++;
            // Reset bits in next byte.
            pcm_byte = 0;
            byte_bit_pos = 8;
        }
        // Check if the word is complete.
        if(word_bit_pos==0)
        {
            // Save completed word.
            pcm_line->words[word_index] = pcm_word;
            if(pcm_bit>112)
            {
                // CRC was read, line is finished, exit cycle.
                break;
            }
            else if(pcm_bit==112)
            {
                // That was the last 14-bit word, set next word to be 16-bit CRCC.
                word_bit_pos = 16;
            }
            else
            {
                // Word was read, set next 14-bit word.
                word_bit_pos = 14;
            }
            // Go to the next word.
            word_index++;
            // Reset bits in next word.
            pcm_word = 0;
        }
        // Shift to the next bit.
        word_bit_pos--;
        byte_bit_pos--;
    }

    // Store shift stage in PCM line.
    pcm_line->shift_stage = shift_sw;
    // Calculate new CRCC for the data.
    pcm_line->calcCRC();
}

//------------------------ Calculate PPB, perform binarization and data fill-up,
//------------------------ calculate and compare CRCC, perform pixel-shift if CRCC failes (if enabled).
uint8_t STC007Binarizer::readPCMdata(STC007Line *pcm_line, uint8_t thread_id, bool no_log)
{
    uint8_t shift_try_cnt;
    //----------- STEP 8: Calculate PPB, perform binarization and data fill-up,
    //----------- calculate and compare CRCC, perform pixel-shift if CRCC failes if enabled.
    // Check if PCM pattern was detected.
    if(pcm_line->hasMarkers()==true)
    {
        // Calculate PPB.
        pcm_line->updatePPB();
#if LB_EN_DBG_OUT
        if(((log_level&LOG_PROCESS)!=0)&&(no_log!=true))
        {
            QString log_line;
            log_line.sprintf("[LB-%02u] Calculated PPB: %u.%u", thread_id, pcm_line->getPPB(), pcm_line->getPPBfrac());
            qInfo()<<log_line;
        }
#endif

        // Set counter outside of the pixel shift cycle limits.
        shift_try_cnt = 4;
        if(do_pixel_shift==true)
        {
            // Set the first pixel shift cycle.
            shift_try_cnt = 0;
        }

        // Pixel offset retry cycle.
        do
        {
            // Binarize the video line, fill up data words, calculate CRC.
            fillDataWords(pcm_line, shift_try_cnt);

            // Stop pixel shifting if CRC is OK.
            if(pcm_line->isCRCvalid()==true) break;

            // Proceed with pixel shifting retrying.
            shift_try_cnt++;
            // Re-store shift stage in PCM line (for indicating failed attempts).
            //pcm_line->shift_stage = shift_try_cnt;
        }
        while(shift_try_cnt<3);

        // Check results.
        if(pcm_line->isCRCvalid()==true)
        {
            // Good reference level.
            return REF_CRC_OK;
        }
        else
        {
            // PCM was detected, but CRC is no good.
            return REF_BAD_CRC;
        }
    }
    else
    {
        // No markers - no PCM data.
        return REF_NO_PCM;
    }
}
